In [1]:
import pandas as pd

# Create a dictionary with three keys, 'A', 'B', and 'C', and lists of 10 numbers as values
data = {'A': list(range(10)),
        'B': list(range(10, 20)),
        'C': list(range(20, 30))}

# Convert the dictionary to a pandas DataFrame
df1 = pd.DataFrame(data)

# Print the DataFrame
df = df1.head()
df

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22
3  3  13  23
4  4  14  24

In [ ]:
Select the first row of the dataframe df using the .iloc[] function.

In [2]:
df.iloc[0]

A     0
B    10
C    20
Name: 0, dtype: int64

In [3]:
df.iloc[-1]

A     4
B    14
C    24
Name: 4, dtype: int64

In [4]:
df.iloc[:3]

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22

In [6]:
df.iloc[:3, 1]

0    10
1    11
2    12
Name: B, dtype: int64

In [ ]:
Use .iloc[] to select the first and third rows, and the first and second columns.

In [7]:
df.iloc[[0,2], :2]

   A   B
0  0  10
2  2  12

In [8]:
df.iloc[:, -1]

0    20
1    21
2    22
3    23
4    24
Name: C, dtype: int64

In [ ]:
For the last exercise, try selecting the second to the fourth row, 
and the first and third column using .iloc[].

In [9]:
df.iloc[2:5, [0,2]]

   A   C
2  2  22
3  3  23
4  4  24

In [10]:
df.iloc[:, 1]

0    10
1    11
2    12
3    13
4    14
Name: B, dtype: int64

In [11]:
df.iloc[2]

A     2
B    12
C    22
Name: 2, dtype: int64

In [13]:
df.iloc[-2:]

   A   B   C
3  3  13  23
4  4  14  24

In [14]:
df.iloc[1:4, 0]

1    1
2    2
3    3
Name: A, dtype: int64

In [15]:
df.iloc[:, [0, 2]]

   A   C
0  0  20
1  1  21
2  2  22
3  3  23
4  4  24

In [17]:
df.iloc[[0, 2, 4], [1,2]]

    B   C
0  10  20
2  12  22
4  14  24

In [18]:
df.iloc[:2, -2:]

    B   C
0  10  20
1  11  21

In [19]:
df.iloc[3, 0]

3

In [20]:
df.iloc[-2, :]

A     3
B    13
C    23
Name: 3, dtype: int64